Q1. List any five functions of the pandas library with execution.

In [1]:
#1 head() used for explore dataframe if we pass parameter head(10) it will show first 10 rows in dataframe.
import pandas as pd
df=pd.DataFrame({'Name':['Pratik','Raj','Ram'],
                 'Age':[25,27,30]})

df.head()

     Name  Age
0  Pratik   25
1     Raj   27
2     Ram   30

In [2]:
#2. Tail used for explore dataframe if we pass parameter tail(10) it will show last 10 rows in dataframe.
df.tail(2)

  Name  Age
1  Raj   27
2  Ram   30

In [3]:
# 3 Drop

newdf = df.drop("Age", axis='columns')

print(newdf)

     Name
0  Pratik
1     Raj
2     Ram

In [4]:
#4.unique
import pandas as pd

# Creating a dataframe
df = pd.DataFrame({'Sports': ['Football', 'Cricket', 'Baseball', 'Basketball',
                'Tennis', 'Table-tennis', 'Archery', 'Swimming', 'Boxing'], 
                'Player': ["Messi", "Afridi", "Chad", "Johnny", "Federer",
                 "Yong", "Mark", "Phelps", "Khan"],
                 'Country': ["Argentina", "Pakistan", "England", "England", "Switzerland",
                 "China", "China", "USA", "Pakistan" ],
                 'Rank': [1, 9, 7, 12, 1, 2, 11, 1, 1] })

# Finding unique countries
print(df["Country"].unique())
# Finding unique rankings
print(df["Rank"].unique())

['Argentina' 'Pakistan' 'England' 'Switzerland' 'China' 'USA']
[ 1  9  7 12  2 11]

In [5]:
#5. value_counts()
df["Country"].value_counts()

Pakistan       2
England        2
China          2
Argentina      1
Switzerland    1
USA            1
Name: Country, dtype: int64

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
df=pd.DataFrame({'A':['Pratik','Raj','Ram'],
                 'B':[25,27,30],
                 'C':['Mumbai','Pune','Delhi']})

df.head()

        A   B       C
0  Pratik  25  Mumbai
1     Raj  27    Pune
2     Ram  30   Delhi

In [7]:
temp=[i for i in range(1,6,2)]
df=df.reindex(temp)
df.head()

     A     B     C
1  Raj  27.0  Pune
3  NaN   NaN   NaN
5  NaN   NaN   NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [8]:
df=pd.DataFrame({'Name':['Pratik','Raj','Ram','Priya','Anshi'],
                 'Values':[25,27,30,80,90]})
sum=0
for i, row in df.iloc[:3].iterrows():
    print(row['Values'])
    sum=sum+row['Values']
    
    
print('The sum of the first three values is {0}'.format(sum))

25
27
30
The sum of the first three values is 82

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [9]:
#'Data Science is fun.'.split(' ')
student=pd.DataFrame({'Name':['Pratik','Raj','Ram'],
                 'Text':['Pratik is student of MSCIT course. He did his masters in IT',
                            'Raj did his Btech from VIT','Ram done his Bcom from Ruia Collge. His want to become CA']})
student['Word_Count']=student.apply(lambda row:len(row['Text'].split(' ')),axis=1)
student.head()

     Name                                               Text  Word_Count
0  Pratik  Pratik is student of MSCIT course. He did his ...          12
1     Raj                         Raj did his Btech from VIT           6
2     Ram  Ram done his Bcom from Ruia Collge. His want t...          12

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [10]:
#  DataFrame.size() will give you total number of elements in dataframe row * columns hence 3*3 Gives 9
student.size

9

In [11]:
# DataFrame.shape() will give (rows,Columns) so that we can understant the noumber of rows and columns in givem dataframe
student.shape

(3, 3)

Q6. Which function of pandas do we use to read an excel file?<br>
read_excel() fuction is used for excel file read<br>
example<br>
data=pd.read_excel('File_name.xlsx')e<br>
data.head()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [12]:
'pratik@gmail.com'.split('@')[0]


df= pd.DataFrame({'Email':['Lisha@gmail.com','Raj_sing@outlook.com','Shivam_jha22@hotmail.com']})
df['Username']=df.apply(lambda row:row['Email'].split('@')[0],axis=1)

df.head()

                      Email      Username
0           Lisha@gmail.com         Lisha
1      Raj_sing@outlook.com      Raj_sing
2  Shivam_jha22@hotmail.com  Shivam_jha22

<pre>
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.
</pre>

In [13]:
data=pd.DataFrame({'A':[3,8,6,2,9],
                   'B':[5,2,9,3,1],
                   'C':[1,7,4,5,2]})

def filter_df(df):
    print(df)
    
    #for i in range(len(df)):
    #    print(df['A'][i])
    print('  ')
    df=df[(df['A']>5) & (df['B']<10)]
    print(df)
            
            
filter_df(data)

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2


Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [14]:

# importing the module
import pandas as pd
 
data={'Values':[5, 9, 8, 5, 7, 8, 1, 2, 3,
                      4, 5, 6, 7, 8, 9, 5, 3]}

s = pd.DataFrame(data)
  
# displaying the dataframe
def stats_info(df):
    print(df)
    
    print('Mean of Values is '+str(df.Values.mean()))
    print('Median of Values is '+str(df.Values.median()))
    print('Standard Deviation of Values is '+str(df.Values.std()))

stats_info(s)

    Values
0        5
1        9
2        8
3        5
4        7
5        8
6        1
7        2
8        3
9        4
10       5
11       6
12       7
13       8
14       9
15       5
16       3
Mean of Values is 5.588235294117647
Median of Values is 5.0
Standard Deviation of Values is 2.4509901960588234

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [15]:
df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,22],
                   'Date': pd.date_range('2022-12-29', periods=31, freq='D')})


df['MovingAverage']=df['Sales'].rolling(window=7).mean()
df

    Sales       Date  MovingAverage
0      10 2022-12-29            NaN
1      20 2022-12-30            NaN
2      30 2022-12-31            NaN
3      40 2023-01-01            NaN
4      50 2023-01-02            NaN
5      10 2023-01-03            NaN
6      20 2023-01-04      25.714286
7      30 2023-01-05      28.571429
8      40 2023-01-06      31.428571
9      50 2023-01-07      34.285714
10     10 2023-01-08      30.000000
11     20 2023-01-09      25.714286
12     30 2023-01-10      28.571429
13     40 2023-01-11      31.428571
14     50 2023-01-12      34.285714
15     10 2023-01-13      30.000000
16     20 2023-01-14      25.714286
17     30 2023-01-15      28.571429
18     40 2023-01-16      31.428571
19     50 2023-01-17      34.285714
20     10 2023-01-18      30.000000
21     20 2023-01-19      25.714286
22     30 2023-01-20      28.571429
23     40 2023-01-21      31.428571
24     50 2023-01-22      34.285714
25     10 2023-01-23      30.000000
26     20 2023-01-24      25.714286
27     30 2023-01-25      28.571429
28     40 2023-01-26      31.428571
29     50 2023-01-27      34.285714
30     22 2023-01-28      31.714286

<pre>
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.


</pre>

In [16]:
df = pd.DataFrame({'Date': pd.date_range('2022-12-29', periods=31, freq='D')})
def weekdays_(df):
    weekday_map={0:'Sunday',1:"Monday",2: "Tuesday",
                  3: "Wednesday", 4:"Thursday",
                   5:"Friday",6: "Saturday",}
    df['Weekday']=df.apply(lambda row: weekday_map[row['Date'].weekday()],axis=1)
    print(df.head(10))
    
weekdays_(df)

        Date    Weekday
0 2022-12-29  Wednesday
1 2022-12-30   Thursday
2 2022-12-31     Friday
3 2023-01-01   Saturday
4 2023-01-02     Sunday
5 2023-01-03     Monday
6 2023-01-04    Tuesday
7 2023-01-05  Wednesday
8 2023-01-06   Thursday
9 2023-01-07     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [17]:
df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,10, 20, 30, 40, 50,22],
                   'Date': pd.date_range('2022-12-29', periods=31, freq='D')})
def date_range(df,start_date,end_date):
    df_range=df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    
    print(df_range)
    
date_range(df,'2023-01-01', '2023-01-31')

    Sales       Date
3      40 2023-01-01
4      50 2023-01-02
5      10 2023-01-03
6      20 2023-01-04
7      30 2023-01-05
8      40 2023-01-06
9      50 2023-01-07
10     10 2023-01-08
11     20 2023-01-09
12     30 2023-01-10
13     40 2023-01-11
14     50 2023-01-12
15     10 2023-01-13
16     20 2023-01-14
17     30 2023-01-15
18     40 2023-01-16
19     50 2023-01-17
20     10 2023-01-18
21     20 2023-01-19
22     30 2023-01-20
23     40 2023-01-21
24     50 2023-01-22
25     10 2023-01-23
26     20 2023-01-24
27     30 2023-01-25
28     40 2023-01-26
29     50 2023-01-27
30     22 2023-01-28

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?<br>
To use the basic functions of pandas, pandas is the first and foremost necessary library that needs to
be imported